www/vm2025/_lib/prod/third/fusioncharts-suite-xt/integrations/rubyonrails/samples/app/views/samples/chart-database.html.erb


        result = SalesRecord.select("Region, SUM(TotalSales) as TotalSales").group("Region")
---
SELECT Region, SUM(TotalSales) as TotalSales FROM "sales_records" GROUP BY "sales_records"."Region"